USE Labor_SQL;
-- ------------------------------------------------------------------------------

-- 1. БД «Комп. фірма». Отримати інформацію про всі принтери, які не є
-- матричними та коштують менше 300 дол. Вихідні дані впорядкувати
-- за спаданням за стовпцем type .

SELECT * FROM Printer
WHERE type != 'Matrix' AND price < 300
ORDER BY type desc;
-- ------------------------------------------------------------------------------

-- 2. БД «Кораблі». З таблиці Ships вивести назви кораблів та роки їх
-- спущення на воду, назва яких не закінчується на літеру 'a' .

SELECT name, launched FROM Ships
WHERE name LIKE '%a';


-- ------------------------------------------------------------------------------

-- 3. БД «Комп. фірма». Вкажіть виробника для тих ПК, що мають
-- жорсткий диск об’ємом не більше 8 Гбайт. Вивести: maker , type ,
-- speed , hd .

SELECT maker, type, speed, hd FROM PC JOIN Product ON PC.model=Product.model
WHERE hd <= 8;
-- ------------------------------------------------------------------------------

-- 4. БД «Комп. фірма». Знайдіть виробників, що випускають одночасно
-- ПК та ноутбуки (використати операцію IN ). Вивести maker .

SELECT distinct maker FROM Product
WHERE type = 'PC' AND maker IN 
(SELECT distinct maker from Product
WHERE type = 'Laptop');
-- ------------------------------------------------------------------------------

-- 7. БД «Комп. фірма». Знайдіть виробників найдешевших кольорових
-- принтерів. Вивести: maker , price .

SELECT maker, price FROM Product JOIN Printer ON Product.model = Printer.model
WHERE
color = 'y'
AND
price IN (SELECT MIN(price) FROM Printer WHERE color = 'y');
-- ------------------------------------------------------------------------------

-- 8. БД «Комп. фірма». Знайдіть середній розмір жорсткого диску ПК
-- кожного з тих виробників, які випускають також і принтери. Вивести:
-- maker , середній розмір жорсткого диску. (Підказка: використовувати
-- підзапити в якості обчислювальних стовпців)

SELECT maker, AVG(hd)
FROM PC JOIN Product ON PC.model = Product.model
WHERE maker = ANY
(SELECT distinct maker FROM Printer JOIN Product ON Printer.model = Product.model)
GROUP BY maker;
-- ------------------------------------------------------------------------------